[
  {
    "Id": 1,
    "content": "Just finished building an amazing React component library! The developer experience is so smooth now. Can't wait to share it with the team. 🚀",
    "author": "Alex Chen",
    "timestamp": "2024-01-20T10:30:00Z",
    "likes": 24,
    "comments": [
      {
        "Id": 1,
        "content": "This sounds amazing! Would love to see the documentation when it's ready.",
        "author": "Sarah Johnson",
        "timestamp": "2024-01-20T11:15:00Z"
      },
      {
        "Id": 2,
        "content": "Great work Alex! Component libraries are game-changers for team productivity.",
        "author": "Mike Rodriguez",
        "timestamp": "2024-01-20T12:00:00Z"
      }
    ]
  },
  {
    "Id": 2,
    "content": "Morning coffee and coding session. There's something magical about solving complex problems with clean, elegant code. What's your favorite way to start the day?",
    "author": "Sarah Johnson",
    "timestamp": "2024-01-20T08:15:00Z",
    "likes": 18,
    "comments": [
      {
        "Id": 3,
        "content": "I love starting with a good cup of tea and reviewing yesterday's code. Fresh perspective always helps!",
        "author": "Emma Thompson",
        "timestamp": "2024-01-20T09:30:00Z"
      }
    ]
  },
  {
    "Id": 3,
    "content": "Pro tip: Always write your tests first. It might feel slower initially, but it saves so much debugging time later. TDD for the win! 💪",
    "author": "Mike Rodriguez",
    "timestamp": "2024-01-19T16:45:00Z",
    "likes": 31,
    "comments": []
  },
  {
    "Id": 4,
    "content": "Just discovered this incredible CSS trick for responsive design. Mind = blown! 🤯 The web development community never ceases to amaze me.",
    "author": "Emma Thompson",
    "timestamp": "2024-01-19T14:20:00Z",
    "likes": 12,
    "comments": []
  },
  {
    "Id": 5,
    "content": "Working on a new machine learning model today. The intersection of AI and web development is fascinating. Anyone else exploring this space?",
    "author": "David Kim",
    "timestamp": "2024-01-19T11:00:00Z",
    "likes": 27,
    "comments": []
  },
  {
    "Id": 6,
    "content": "Reminder: Take breaks! Your best ideas often come when you step away from the screen. Just had a breakthrough during my walk. 🌳",
    "author": "Lisa Wang",
    "timestamp": "2024-01-18T15:30:00Z",
    "likes": 45,
    "comments": []
  },
  {
    "Id": 7,
    "content": "Excited to announce that our team just shipped a major feature! Months of hard work finally paying off. Grateful for this amazing team. 🎉",
    "author": "James Wilson",
    "timestamp": "2024-01-18T13:10:00Z",
    "likes": 52,
    "comments": []
  }
]